Оперативные_задачи_Финиш/src/Documents/ОказаниеУслугСервисМенеджером/ОказаниеУслугСервисМенеджером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОказаниеУслугСервисМенеджером</name>
  <registerRecords>InformationRegister.ПланированиеОказаниеУслуг</registerRecords>
  <attributes>
    <name>СервисМенеджер</name>
    <type>
      <types>CatalogRef.СервисМенеджеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РеализацияТоваровИУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Оперативные_задачи_Финиш/src/InformationRegisters/ПланированиеОказаниеУслуг/ПланированиеОказаниеУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланированиеОказаниеУслуг</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПланируемаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РеальнаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СервисМенеджер</name>
    <type>
      <types>CatalogRef.СервисМенеджеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровИУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Оперативные_задачи_Финиш/src/Documents/ОказаниеУслугСервисМенеджером/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланированиеОказаниеУслуг
	Движения.ПланированиеОказаниеУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ПланированиеОказаниеУслуг.Добавить();
		Движение.Период = Дата;
		Движение.СервисМенеджер = СервисМенеджер;
		Движение.Услуга = ТекСтрокаСостав.Услуга;
		Движение.Контрагент = ТекСтрокаСостав.Контрагент;
		Движение.ДокументОснование = ТекСтрокаСостав.ДокументОснование;
		Движение.ПланируемаяДатаВыполнения = ТекСтрокаСостав.ПланируемаяДатаВыполнения;
		Движение.РеальнаяДатаВыполнения = Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ЗаполнитьСостав() Экспорт

	Состав.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланированиеОказаниеУслугСрезПоследних.Услуга,
		|	ПланированиеОказаниеУслугСрезПоследних.Контрагент,
		|	ПланированиеОказаниеУслугСрезПоследних.ДокументОснование,
		|	ПланированиеОказаниеУслугСрезПоследних.РеальнаяДатаВыполнения КАК РеальнаяДатаВыполнения,
		|	ПланированиеОказаниеУслугСрезПоследних.ПланируемаяДатаВыполнения
		|ИЗ
		|	РегистрСведений.ПланированиеОказаниеУслуг.СрезПоследних(, СервисМенеджер = &СервисМенеджер) КАК
		|		ПланированиеОказаниеУслугСрезПоследних
		|ГДЕ
		|	ПланированиеОказаниеУслугСрезПоследних.РеальнаяДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("СервисМенеджер", СервисМенеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = Состав.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры
